<table align="left">
  <td>
    <a href="https://colab.research.google.com/github/marco-canas/didactica_ciencia_datos/blob/main/propu/unidad_didac/5_clasificacion/4_titanic/4_titanic.ipynb#scrollTo=c4cc5ae7" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>
  </td>
</table>

# Construcción de modelo predictivo con el dataset Titanic

In [2]:
url = 'https://raw.githubusercontent.com/marco-canas/didactica_ciencia_datos/main/datasets/titanic/titanic_train.csv'

In [3]:
import numpy as np 
import pandas as pd

In [4]:
df = pd.read_csv(url)

In [6]:
df.head(2)

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0

# ¿Qué preguntas harias para impactar con este dataset?

¿Cómo determinar los atributos mejores predictores de la supervivencia de un pasajero del Titanic?

¿Qué modelos de Machine learning son apropiados para construir clasificador binario que prediga con un desempeño de más del 90% la sobrevivencia de un pasajero del Titanic?

¿Qué modelos de Machine learning son apropiados para construir regresor que prediga con un desempeño de más del 90% la probabilidad de sobrevivencia de un pasajero del Titanic?

## Exploración tabular de los datos

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 850 entries, 0 to 849
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  850 non-null    int64
 1   pclass        850 non-null    int64
 2   name          850 non-null    object
 3   sex           850 non-null    object
 4   age           676 non-null    float64
 5   sibsp         850 non-null    int64
 6   parch         850 non-null    int64
 7   ticket        850 non-null    object
 8   fare          849 non-null    float64
 9   cabin         191 non-null    object
 10  embarked      849 non-null    object
 11  boat          308 non-null    object
 12  body          73 non-null     float64
 13  home.dest     464 non-null    object
 14  survived      850 non-null    int64
dtypes: float64(3), int64(5), object(7)
memory usage: 99.7+ KB

In [8]:
df.drop(['name'], axis = 1, inplace = True)

In [9]:
df.head()

,passenger_id,pclass,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0